OpenFOAM/kOmega_pimple/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

solver displacementSBRStress;
//solver displacementLaplacian;
//solver displacementComponentLaplacian
//solver displacementInterpolation
//solver velocityComponentLaplacian x;
//solver velocityLaplacian;

//diffusivity  uniform;
//diffusivity  directional (10 .10 1);
//diffusivity  motionDirectional (.10 10 1);
//diffusivity  inverseDistance 2 (ribletTop ribletBottom);
//diffusivity  file motionDiffusivity;
diffusivity  quadratic inverseDistance 2 (ribletTop ribletBottom);
//diffusivity  exponential 0.1 inverseDistance 2 (ribletTop ribletBottom);

// ************************************************************************* //
