OpenFOAM/kOmega_pimple/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
	{
		type			fixedValue;
		value			$internalField;
	}

    outlet
	{
        type			zeroGradient;
	}

    "riblet.*"
    {
        type            fixedValue;
		value			uniform (0 0 0);
    }
	
	topAndBottom
	{
		type			slip;
	}
	
	front
	{
		type			empty;
	}
	
	back
	{
		type			empty;
	}
}


// ************************************************************************* //
