OpenFOAM/kOmega_pimple/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-12;

boundaryField
{
	inlet
	{
		type					fixedValue;
		value					$internalField;
	}

	outlet
	{
        type            inletOutlet;
        inletValue      uniform 0;
        value           $internalField;
	}

    "riblet.*"
    {
        type            fixedValue;
        value           $internalField;
    }

	topAndBottom
	{
		type			slip;
	}

	front
	{
		type			empty;
	}
	
	back
	{
		type			empty;
	}
}


// ************************************************************************* //
