OpenFOAM/kOmega_pimple/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 9.3081e-6;

boundaryField
{
    inlet
	{
		type			calculated;
		value			uniform 0;
	}

	outlet
	{
		type			calculated;
		value			uniform 0;
	}
	
	"riblet.*"
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }

	topAndBottom
	{
		type			slip;
	}
	
	front
	{
		type			empty;
	}
	
	back
	{
		type			empty;
	}
}


// ************************************************************************* //
