OpenFOAM/kOmega_pimple/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.0061;

boundaryField
{
    inlet
	{
		type			fixedValue;
		value			$internalField;
	}
	
	outlet
	{
        type            zeroGradient;
	}

    "riblet.*"
    {
        type            zeroGradient;
    }

	topAndBottom
	{
		type			slip;
	}
	
	front
	{
		type			empty;
	}
	
	back
	{
		type			empty;
	}
}


// ************************************************************************* //
