OpenFOAM/kOmega_pimple/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default backward;
}

gradSchemes
{
	default cellLimited Gauss linear 0.3333;
}

divSchemes
{
    default         none;
	
	div(phi,U)  	Gauss LUST grad(U);

    div(phi,k)      Gauss linearUpwind grad(k);
    div(phi,omega)  Gauss linear;
	
    
	div((nuEff*dev2(T(grad(U))))) 	Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.333;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
