OpenFOAM/kOmega_pimple/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "pcorr.*"
    {
        solver           PCG;
		preconditioner	 DIC;
        tolerance        0.02;
        relTol           0;
		minIter		 	3;
    }
	
	p
	{
        $pcorr;
        tolerance        1e-6;
        relTol           0.01;
	}

    "(U|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
		minIter			2;
    }
	
	pFinal
    {
        $p;
        tolerance        1e-7;
        relTol           0;
    }
	
    "(U|k|omega)Final"
    {
        $U;
        tolerance       1e-06;
        relTol          0;
    }
    
	cellMotionUx
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
    }
    
	cellMotionUxFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
    }
    
	cellMotionU
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0;
    }
	
    "cellDisplacement.*"
    {
        solver          GAMG;
        tolerance       1e-5;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
}

PIMPLE
{
    correctPhi                  yes;
    checkMeshCourantNo          yes;
    
    nNonOrthogonalCorrectors    3;
    nCorrectors                 3;
    nOuterCorrectors            100;
 
    residualControl
    {
        U
        {
                tolerance  1e-5;
                relTol      0;
        }
        "(p|omega|k)"
        {
                tolerance  5e-4;
                relTol      0;
        }
     }
}
 
relaxationFactors
{
    fields
    {
		p					0.3;
    }
    equations
    {
        "(U|k|omega)"     	1.0;
        "(U|k|omega)Final"   	1.0;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
