OpenFOAM/kOmega_pimple/Allrun.solve
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

processors=7

mpirun -np $processors pimpleMeshCoFoam -parallel | tee log.pimpleMeshCoFoam

runApplication reconstructPar

rm -r processor*
#------------------------------------------------------------------------------
